Pandas (Series) vs Pandas (Data Frame)

PANDAS (SERIES)

In [1]:
import pandas as pd
X=pd.Series([10,20,30,40])
X

0    10
1    20
2    30
3    40
dtype: int64

PANDAS (DATA FRAME)

In [2]:
import pandas as pd
df=pd.DataFrame([10,20,30,40])
df

    0
0  10
1  20
2  30
3  40

Pandas Data Frame Can be Created By using
.List
.Nested List
.Dictionary
.Numpy Array
.Series

Pandas Data Frame Using Python List

In [4]:
import pandas as pd
df=pd.DataFrame([32,49,80])
df

    0
0  32
1  49
2  80

pandas Data Frame Using Nested List

In [5]:
S1=[['Gnani',99],['Mohan',98],['Marthand',99],['sai',100]]
S1

[['Gnani', 99], ['Mohan', 98], ['Marthand', 99], ['sai', 100]]

In [8]:
df=pd.DataFrame(S1)
print(df)

          0    1
0     Gnani   99
1     Mohan   98
2  Marthand   99
3       sai  100

pandas Data Frame using Dictionary

In [12]:
d1={'Name':['marthand','krishna','nikil'],
     'marks':[100,98,98]}   
d1

{'Name': ['marthand', 'krishna', 'nikil'], 'marks': [100, 98, 98]}

In [13]:
df=pd.DataFrame(d1)
print(df)

       Name  marks
0  marthand    100
1   krishna     98
2     nikil     98

Pandas Data Frame Using Combinations of Series

In [14]:
d={'name':pd.Series(['sai','nikhil','surya']),
   'marks':pd.Series([99,80,90])}
df=pd.DataFrame(d)
print(df)

     name  marks
0     sai     99
1  nikhil     80
2   surya     90

In [24]:
d={'city':['Ahamedabad','anand','baroda'],
   'Temapature':[40.1,35.2,38.5]}
df=pd.DataFrame(d,index=['A','B','C'])
print(df)

         city  Temapature
A  Ahamedabad        40.1
B       anand        35.2
C      baroda        38.5

Viewing OR Inspecting Data Frame Using Pandas Data Frame

In [1]:
import pandas as pd
d={'Name':['Gopi','Navya','Sandhya','Soni','Gnani','Sai','Rupa'],
   'Marks':[98,89,99,87,90,83,82]}
df=pd.DataFrame(d,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])
print(df)

         Name  Marks
stu1     Gopi     98
stu2    Navya     89
stu3  Sandhya     99
stu4     Soni     87
stu5    Gnani     90
stu6      Sai     83
stu7     Rupa     82

SHAPE

In [2]:
df.shape

(7, 2)

HEAD()

In [3]:
df.head()

         Name  Marks
stu1     Gopi     98
stu2    Navya     89
stu3  Sandhya     99
stu4     Soni     87
stu5    Gnani     90

In [4]:
df.head(2)

       Name  Marks
stu1   Gopi     98
stu2  Navya     89

In [5]:
df.head(5)

         Name  Marks
stu1     Gopi     98
stu2    Navya     89
stu3  Sandhya     99
stu4     Soni     87
stu5    Gnani     90

In [6]:
df.head(6)

         Name  Marks
stu1     Gopi     98
stu2    Navya     89
stu3  Sandhya     99
stu4     Soni     87
stu5    Gnani     90
stu6      Sai     83

TAIL

In [7]:
df.tail()

         Name  Marks
stu3  Sandhya     99
stu4     Soni     87
stu5    Gnani     90
stu6      Sai     83
stu7     Rupa     82

In [8]:
df.tail(3)

       Name  Marks
stu5  Gnani     90
stu6    Sai     83
stu7   Rupa     82

In [9]:
df.tail(7)

         Name  Marks
stu1     Gopi     98
stu2    Navya     89
stu3  Sandhya     99
stu4     Soni     87
stu5    Gnani     90
stu6      Sai     83
stu7     Rupa     82

To KNOW THE COLUMN NAMES

In [11]:
df.columns

Index(['Name', 'Marks'], dtype='object')

INFORMATION ABOUT DATA FRAME

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, stu1 to stu7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
dtypes: int64(1), object(1)
memory usage: 468.0+ bytes

WE CAN ACESS THE COLUMNS OF DATA FRAME

In [14]:
df.Name

stu1       Gopi
stu2      Navya
stu3    Sandhya
stu4       Soni
stu5      Gnani
stu6        Sai
stu7       Rupa
Name: Name, dtype: object

OR

In [17]:
df['Name']

stu1       Gopi
stu2      Navya
stu3    Sandhya
stu4       Soni
stu5      Gnani
stu6        Sai
stu7       Rupa
Name: Name, dtype: object

In [18]:
df['Marks']

stu1    98
stu2    89
stu3    99
stu4    87
stu5    90
stu6    83
stu7    82
Name: Marks, dtype: int64

IF YOU WANT TO DISPLAY ALL COLUMNS SO WE USE THIS DF[['NAME','MARKS']]

In [19]:
df[['Name','Marks']]

         Name  Marks
stu1     Gopi     98
stu2    Navya     89
stu3  Sandhya     99
stu4     Soni     87
stu5    Gnani     90
stu6      Sai     83
stu7     Rupa     82

TO FIND THE MIN VALUE IN THE DATA FRAME

FOR WHOLE DATA for min value

In [20]:
df.min()

Name     Gnani
Marks       82
dtype: object

ONLY MARKS COLUMN FOR MIN VALUE

In [21]:
df['Marks'].min()

np.int64(82)

MAXIMUM VALUE IN DATA FRAME

In [23]:
df['Marks'].max()

np.int64(99)

TO FIND THE AVERAGE VALUE OF THE MARKS COLUMN

In [24]:
df['Marks'].mean()

np.float64(89.71428571428571)

IF WE WANT SOME STATISTICAL FUNCTIONS IN DATAFRAME WE USE DESCRIBE

In [26]:
df.describe()

           Marks
count   7.000000
mean   89.714286
std     6.676184
min    82.000000
25%    85.000000
50%    89.000000
75%    94.000000
max    99.000000

VALUE_COUNTS FOR COUNT OF UNIQUE VALUES

In [28]:
import pandas as pd
d={'Name':['Gopi','Navya','Sandhya','Soni','Gnani','Sai','Rupa'],
   'Marks':[98,89,99,87,99,83,99]}
df=pd.DataFrame(d,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])
print(df)

         Name  Marks
stu1     Gopi     98
stu2    Navya     89
stu3  Sandhya     99
stu4     Soni     87
stu5    Gnani     99
stu6      Sai     83
stu7     Rupa     99

In [29]:
df['Marks'].value_counts()

Marks
99    3
98    1
89    1
87    1
83    1
Name: count, dtype: int64

COUNTS=it REturns the non-null values

In [32]:
df['Marks'].count()

np.int64(7)

LOC VS ILOC

In [3]:
import pandas as pd
d={'Name':['Nani','sai','soni','Puppy','Milky','Nikki','Sanju'],
    'Marks':[98,89,99,87,90,83,82],
    'Grades':['AA','AB','AA','AB','AC','BA','BB']}
df=pd.DataFrame(d)
print (df)

    Name  Marks Grades
0   Nani     98     AA
1    sai     89     AB
2   soni     99     AA
3  Puppy     87     AB
4  Milky     90     AC
5  Nikki     83     BA
6  Sanju     82     BB

LOC: I WANT TO SELECT FIRST ROW WITH ALL COLUMNS:i.e nani,98,AA

In [7]:
df.loc[0,:]

Name      Nani
Marks       98
Grades      AA
Name: 0, dtype: object

NOW I WANT TO PRINT FIRST 3 rows and all 3 colums

In [9]:
df.loc[0:3,:]

    Name  Marks Grades
0   Nani     98     AA
1    sai     89     AB
2   soni     99     AA
3  Puppy     87     AB

ALL ROWS OF NAME COLUMS IN THE LOC METHOD

In [10]:
df.loc[:,'Name']

0     Nani
1      sai
2     soni
3    Puppy
4    Milky
5    Nikki
6    Sanju
Name: Name, dtype: object

ALL ROWS OF NAME,MARKS COLUMNS IN LOC METHOD

In [12]:
df.loc[:,['Name','Marks']]

    Name  Marks
0   Nani     98
1    sai     89
2   soni     99
3  Puppy     87
4  Milky     90
5  Nikki     83
6  Sanju     82

I WANT ALL ROWS & ALL COLUMNS IN LOC METHOD

In [13]:
df.loc[:,'Name':]

    Name  Marks Grades
0   Nani     98     AA
1    sai     89     AB
2   soni     99     AA
3  Puppy     87     AB
4  Milky     90     AC
5  Nikki     83     BA
6  Sanju     82     BB

ILOC

In [15]:
df.iloc[:,0]

0     Nani
1      sai
2     soni
3    Puppy
4    Milky
5    Nikki
6    Sanju
Name: Name, dtype: object

I want all the rows and Name,marks only in columns for iloc

In [16]:
df.iloc[:,0:2]

    Name  Marks
0   Nani     98
1    sai     89
2   soni     99
3  Puppy     87
4  Milky     90
5  Nikki     83
6  Sanju     82

In [1]:
import pandas as pd
d={'Name':['Nani','sai','soni','Puppy','Milky','Nikki','Sanju'],
    'Marks':[98,89,99,87,90,83,82],
    'Grades':['AA','AB','AA','AB','AC','BA','BB']}
df=pd.DataFrame(d,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])
print (df)

       Name  Marks Grades
stu1   Nani     98     AA
stu2    sai     89     AB
stu3   soni     99     AA
stu4  Puppy     87     AB
stu5  Milky     90     AC
stu6  Nikki     83     BA
stu7  Sanju     82     BB

NAME,MARKS&GRADES OF STU1,STUD2 LOC METHOD

In [2]:
df.loc[['stu1','stu2'],:]

      Name  Marks Grades
stu1  Nani     98     AA
stu2   sai     89     AB

#ONLY NAME OF STU1 TO STU4

In [3]:
df.loc['stu1':'stu4','Name']

stu1     Nani
stu2      sai
stu3     soni
stu4    Puppy
Name: Name, dtype: object

ILOC WE CAN ACCESS ROW & COLUMN uSING INDEX POSITION

# NAME AND MARKS OF STU1,STU2 USING ILOC

In [4]:
df.iloc[[0,1],[0,1]]

      Name  Marks
stu1  Nani     98
stu2   sai     89

NAME ,MARKS & GRADES OF STU1,STU2,STU3 BY USING ILOC METHOD

In [5]:
df.iloc[0:3,:]

      Name  Marks Grades
stu1  Nani     98     AA
stu2   sai     89     AB
stu3  soni     99     AA

In [6]:
pd.__version__

'2.2.3'

#LOC VS ILOC VS IAT VS AT

In [8]:
import pandas as pd
d={'Name':['Ramya','Devi','Sanju','Teja','Navya','Priya','Divi'],
   'Marks':[98,89,99,87,90,83,82],
   'Grade':['AA','AB','AA','AB','AC','BA','BB']}
df=pd.DataFrame(d,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])
df

       Name  Marks Grade
stu1  Ramya     98    AA
stu2   Devi     89    AB
stu3  Sanju     99    AA
stu4   Teja     87    AB
stu5  Navya     90    AC
stu6  Priya     83    BA
stu7   Divi     82    BB

# LOC = ACESSING A GROUP OF ROWS & COLUMNS BY LABLE(S)

 1.NAME,MARKS & GRADES OF STU1 AND STU2

In [10]:
df.loc[['stu1','stu2'],:]

       Name  Marks Grade
stu1  Ramya     98    AA
stu2   Devi     89    AB

2.NAME,MARKS & GRADES OF STU1,STU3,STU5

In [12]:
df.loc[['stu1','stu3','stu5'],['Name','Grade']]

       Name Grade
stu1  Ramya    AA
stu3  Sanju    AA
stu5  Navya    AC

3.NAME ,MARKS & GRADES OF STU1 TO STU7

In [13]:
df.loc['stu1':'stu7',:]

       Name  Marks Grade
stu1  Ramya     98    AA
stu2   Devi     89    AB
stu3  Sanju     99    AA
stu4   Teja     87    AB
stu5  Navya     90    AC
stu6  Priya     83    BA
stu7   Divi     82    BB

ILOC =ACESSING  A GROUP OF ROWS AND COLUMNS BY INTEGER POSITION

 1.NAMES,MARKS & GRADES OF stu1 & stu2

In [14]:
df.iloc[[0,1],:]

       Name  Marks Grade
stu1  Ramya     98    AA
stu2   Devi     89    AB

 2.NAMES & GRADES OF STU1,STU3,STU5

In [15]:
df.iloc[[0,2,4],[0,2]]

       Name Grade
stu1  Ramya    AA
stu3  Sanju    AA
stu5  Navya    AC

3.NAMES,MARKS,GRADES OF STU1 TO STU7

In [17]:
df.iloc[0:7,0:3]

       Name  Marks Grade
stu1  Ramya     98    AA
stu2   Devi     89    AB
stu3  Sanju     99    AA
stu4   Teja     87    AB
stu5  Navya     90    AC
stu6  Priya     83    BA
stu7   Divi     82    BB

IAT = USE IAT IF YOU ONLY NEED TO GET OR SET SINGLE VALUE IN A DATA FRAME SERIES

PRINT GRADE OF STU2

In [ ]:
df.iat[1,2]

'AB'

PRINT NAME OF STU5

In [22]:
df.iat[4,0]

'Navya'

SET THE MARKS OF STU5 TO 99

In [26]:
df.iat[4,1]=99
print(df)

       Name  Marks Grade
stu1  Ramya     98    AA
stu2   Devi     89    AB
stu3  Sanju     99    AA
stu4   Teja     87    AB
stu5  Navya     99    AC
stu6  Priya     83    BA
stu7   Divi     82    BB

AT = USE AT IF YOU ONLY NEED TO GET OR SET SINGLE VALUE IN A DATA FRAME SERIES

1.PRINT GRADE OF STU2

In [30]:
df.at['stu2','Grade']

'AB'

SET THE MARKS OF STU5 TO 99

In [32]:
df.at['stu5','Marks']=100
df

       Name  Marks Grade
stu1  Ramya     98    AA
stu2   Devi     89    AB
stu3  Sanju     99    AA
stu4   Teja     87    AB
stu5  Navya    100    AC
stu6  Priya     83    BA
stu7   Divi     82    BB

3.PRINT NAME OF STU5

In [33]:
df.at['stu5','Name']

'Navya'

LOC AND ILOC  WITH BOOLEAN ARRAY

LOC WITH BOLLEAN ARRAY

In [34]:
df

       Name  Marks Grade
stu1  Ramya     98    AA
stu2   Devi     89    AB
stu3  Sanju     99    AA
stu4   Teja     87    AB
stu5  Navya    100    AC
stu6  Priya     83    BA
stu7   Divi     82    BB

1.NAME OF STU1 AND STUD4 USING LOC WITH BOLLEAN ARRAY

In [38]:
df.loc[[True,True,False,False,False,False,False],[True,False,False]]

       Name
stu1  Ramya
stu2   Devi

2.GRADES OF STU1 AND STU 4

In [39]:
df.loc[[True,False,False,True,False,False,False],[False,False,True]]

     Grade
stu1    AA
stu4    AB

3.Marks of stu4

In [40]:
df.loc[[False,False,False,True,False,False,False],[False,True,False]]

      Marks
stu4     87